// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура UMC_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	UMC_ОбменСUmico.ПолучитьСтатусОбменаСUmico(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура UMC_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "UMC_ИзменениеСостоянияЧека" И Параметр = Объект.Ссылка Тогда
		UMC_ПолучитьСтатусОбменаСUmico();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура UMC_ПолучитьСтатусОбменаСUmico()
	
	UMC_ОбменСUmicoВызовСервера.ПолучитьСтатусОбменаСUmico(ЭтотОбъект, Объект.Ссылка);	
	
КонецПроцедуры

#КонецОбласти