// @strict-types
#Область СлужебныеПроцедурыИФункции

#Область ТипизирующиеФункции

// Новая структура JSONBalance.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураJSONBalance
Функция НоваяСтруктураJSONBalance() Экспорт

	Возврат UMC_ОбменСUmico.НоваяСтруктураJSONBalance();

КонецФункции

// Новая структура сведения о счете.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураСведенияОСчете
Функция НоваяСтруктураСведенияОСчете() Экспорт

	Возврат UMC_ОбменСUmico.НоваяСтруктураСведенияОСчете();

КонецФункции

// Новая структура ответ HTTPЗапроса.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураОтветHTTPЗапроса
Функция НоваяСтруктураОтветHTTPЗапроса() Экспорт

	Возврат UMC_ОбменСUmico.НоваяСтруктураОтветHTTPЗапроса();

КонецФункции

// Новая структура результат ввода счет Umcio.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураРезультатВводаСчетUmcio
Функция НоваяСтруктураРезультатВводаСчетUmcio() Экспорт
	
	Возврат UMC_ОбменСUmico.НоваяСтруктураРезультатВводаСчетUmcio();
	
КонецФункции

#КонецОбласти

#КонецОбласти