// @strict-types
#Область СлужебныеПроцедурыИФункции

// Получить статус обмена с Umico.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//	Документ - ДокументСсылка.ЧекККМ,ДокументСсылка.ЧекККМВозврат,ДокументСсылка.РеализацияТоваровУслуг,ДокументСсылка.ВозвратТоваровОтКлиента
Процедура ПолучитьСтатусОбменаСUmico(Форма, Документ) Экспорт
	
	UMC_ОбменСUmico.ПолучитьСтатусОбменаСUmico(Форма, Документ);
	
КонецПроцедуры

#Область ТипизирующиеФункции

// Новая структура JSONBalance.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураJSONBalance
Функция НоваяСтруктураJSONBalance() Экспорт

	Возврат UMC_ОбменСUmico.НоваяСтруктураJSONBalance();

КонецФункции

// Новая структура сведения о карте.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураСведенияОКартеUmico
Функция НоваяСтруктураСведенияОКарте() Экспорт

	Возврат UMC_ОбменСUmico.НоваяСтруктураСведенияОКартеUmico();

КонецФункции

// Новая структура ответ HTTPЗапроса.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураОтветHTTPЗапроса
Функция НоваяСтруктураОтветHTTPЗапроса() Экспорт

	Возврат UMC_ОбменСUmico.НоваяСтруктураОтветHTTPЗапроса();

КонецФункции

// Новая структура результат ввода карты Umico.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураРезультатВводаКартыUmico
Функция НоваяСтруктураРезультатВводаКартыUmico() Экспорт
	
	Возврат UMC_ОбменСUmico.НоваяСтруктураРезультатВводаКартыUmico();
	
КонецФункции

#КонецОбласти

#КонецОбласти