// @strict-types
#Область СлужебныеПроцедурыИФункции

#Область ТипизирующиеФункции

// Новая структура JSONBalance.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураJSONBalance
Функция НоваяСтруктураJSONBalance() Экспорт

	Возврат UMC_ОбменСUmico.НоваяСтруктураJSONBalance();

КонецФункции

// Новая структура сведения о карте.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураСведенияОКартеUmico
Функция НоваяСтруктураСведенияОКарте() Экспорт

	Возврат UMC_ОбменСUmico.НоваяСтруктураСведенияОКартеUmico();

КонецФункции

// Новая структура ответ HTTPЗапроса.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураОтветHTTPЗапроса
Функция НоваяСтруктураОтветHTTPЗапроса() Экспорт

	Возврат UMC_ОбменСUmico.НоваяСтруктураОтветHTTPЗапроса();

КонецФункции

// Новая структура результат ввода карты Umico.
// 
// Возвращаемое значение:
//  см. UMC_ОбменСUmico.НоваяСтруктураРезультатВводаКартыUmico
Функция НоваяСтруктураРезультатВводаКартыUmico() Экспорт
	
	Возврат UMC_ОбменСUmico.НоваяСтруктураРезультатВводаКартыUmico();
	
КонецФункции

#КонецОбласти

#КонецОбласти