// @strict-types
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура UMC_ОплатитьБалламиUmicoПосле(Команда)

	UMC_ДополнительныеПараметры = Новый Структура;
	//@skip-check wrong-string-literal-content
	//@skip-check notify-description-to-server-procedure
	UMC_ДополнительныеПараметры.Вставить("ОповещениеВФормуОплаты", Новый ОписаниеОповещения("ОплатаЗавершение",
		ЭтотОбъект));
	UMC_ДополнительныеПараметры.Вставить("ПолученоНаличными", РозничныеПродажиКлиентСервер.ПривестиСтрокуКЧислу(
		ПолученоНаличными));

	//@skip-check wrong-string-literal-content
	ВыполнитьОбработкуОповещения(
		Новый ОписаниеОповещения("UMC_ДобавитьОплатуБалламиUmico", ВладелецФормы, UMC_ДополнительныеПараметры), Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&После("РассчитатьИтоги")
&НаКлиентеНаСервереБезКонтекста
Процедура UMC_РассчитатьИтоги(Форма, ИнформацияОбОплате)

	//@skip-check property-return-type
	Форма.СуммаОплаты = РозничныеПродажиКлиентСервер.ПривестиСтрокуКЧислу(Форма.ПолученоНаличными) + Форма.ОплаченоБонуснымиБаллами
		+ Форма.ОплаченоПлатежнымиКартами + Форма.ОплаченоСертификатами + Форма.UMC_ОплаченоБалламиUmico;

КонецПроцедуры

// UMC оплата завершение.
// 
// Параметры:
//  ИнформацияОбОплате - Структура:
// * БаллыUmico - Число
//  ДополнительныеПараметры - Структура
&Перед("ОплатаЗавершение")
&НаКлиенте
Процедура UMC_ОплатаЗавершение(ИнформацияОбОплате, ДополнительныеПараметры) Экспорт

	UMC_ОплаченоБалламиUmico = ИнформацияОбОплате.БаллыUmico;

КонецПроцедуры

#КонецОбласти