// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

&После("ЗаполнитьПоЧекуККМ")
Процедура UMC_ЗаполнитьПоЧекуККМ(Знач ДокументОснование, ДанныеЗаполнения)

	UMC_РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "UMC_НомерКартыUmico");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, UMC_РеквизитыОснования);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли