// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура UMC_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	UMC_ОбменСUmico.ПолучитьСтатусОбменаСUmico(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура UMC_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "UMC_ИзменениеСостоянияЧека" И Параметр = Объект.Ссылка Тогда
		UMC_ПолучитьСтатусОбменаСUmico();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура UMC_UMC_СписатьЗадолженностьПоUmicoПосле(Команда)
	
	UMC_Структура = UMC_ОбменСUmicoВызовСервера.НоваяСтруктураЗаполненияСписания();
	UMC_Структура.Основание = Объект.Ссылка;
	UMC_Структура.СписаниеЗаСчетUmico = Истина;
	
	UMC_ПараметрыФормы = Новый Структура;
	UMC_ПараметрыФормы.Вставить("Основание", UMC_Структура);
	
	ОткрытьФорму("Документ.СписаниеЗадолженности.Форма.ФормаДокумента", UMC_ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура UMC_ПолучитьСтатусОбменаСUmico()
	
	UMC_ОбменСUmicoВызовСервера.ПолучитьСтатусОбменаСUmico(ЭтотОбъект, Объект.Ссылка);	
	
КонецПроцедуры

#КонецОбласти