// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура UMC_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	UMC_ОбменСUmico.ПолучитьСтатусОбменаСUmico(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура UMC_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "UMC_ИзменениеСостоянияЧека" И Параметр = Объект.Ссылка Тогда
		UMC_ПолучитьСтатусОбменаСUmico();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура UMC_ПолучитьСтатусОбменаСUmico()
	
	UMC_ОбменСUmicoВызовСервера.ПолучитьСтатусОбменаСUmico(ЭтотОбъект, Объект.Ссылка);	
	
КонецПроцедуры

&Вместо("ПересчитатьДокументНаКлиенте")
&НаКлиенте
// ИзменениеИКонтроль не используется по причине нестабильности.
//@skip-check module-unused-local-variable
//@skip-check extension-variable-prefix
//@skip-check property-return-type
//@skip-check invocation-parameter-type-intersect
Процедура UMC_ПересчитатьДокументНаКлиенте()

	СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(Объект.Товары, Объект.ЦенаВключаетНДС);
	ОплаченоПрочее = Объект.ОплатаПлатежнымиКартами.Итог("Сумма") + Объект.ПодарочныеСертификаты.Итог("Сумма");
	//#Вставка
		ОплаченоПрочее = ОплаченоПрочее + Объект.UMC_ОплаченноБалламиUmico;
	//#КонецВставки
	СуммаСдачи = Объект.ОплатаПлатежнымиКартами.Итог("Сумма") + Объект.ПодарочныеСертификаты.Итог("Сумма") + Объект.ПолученоНаличными - Объект.СуммаДокумента;
	//#Вставка
	СуммаСдачи = СуммаСдачи + Объект.UMC_ОплаченноБалламиUmico;
	//#КонецВставки
	СуммаСкидки = Объект.Товары.Итог("СуммаРучнойСкидки") + Объект.Товары.Итог("СуммаАвтоматическойСкидки");
	СуммаБезСкидки = Объект.СуммаДокумента + СуммаСкидки;

КонецПроцедуры

#КонецОбласти