// @strict-types
#Область СлужебныеПроцедурыИФункции

#Область ТипизирующиеФункции

// Новая структура JSON Balance.
// 
// Возвращаемое значение:
//  Структура - Новая структура JSON Balance:
// * available_points - Число -
Функция НоваяСтруктураJSONBalance() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("available_points", 0);

	Возврат Структура;

КонецФункции

// Новая структура JSON Checkout.
// 
// Возвращаемое значение:
//  Структура - Новая структура JSON Checkout:
// * order_ext_id - Строка -
Функция НоваяСтруктураJSONCheckout() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("order_ext_id", "");

	Возврат Структура;

КонецФункции

// Новая структура JSON Status.
// 
// Возвращаемое значение:
//  Структура - Новая структура JSON Status:
// * status - Строка -
Функция НоваяСтруктураJSONStatus() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("status", "");

	Возврат Структура;

КонецФункции

// Новая структура сведения о счете.
// 
// Возвращаемое значение:
//  Структура - Новая структура сведения о счете:
// * Результат - Булево -
// * Сумма - Число -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураСведенияОСчетеUmico() Экспорт

	Возврат Новый Структура("Результат, Сумма, ТекстОшибки", Ложь, 0, "");

КонецФункции

// Новая структура данные регистрации чека.
// 
// Возвращаемое значение:
//  Структура - Новая структура сведения о счете:
// * Результат - Булево -
// * Идентификатор - Строка -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураДанныеРегистрацииЧекаUmico() Экспорт

	Возврат Новый Структура("Результат, Идентификатор, ТекстОшибки", Ложь, "", "");

КонецФункции

// Новая структура статус чека.
// 
// Возвращаемое значение:
//  Структура - Новая структура статус чека:
// * Результат - Булево -
// * Ожидание - Булево -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураСтатусЧекаUmico() Экспорт

	Возврат Новый Структура("Результат, Ожидание, ТекстОшибки", Ложь, Ложь, "");

КонецФункции

// Новая структура ОтветHTTPЗапроса.
// 
// Возвращаемое значение:
//  Структура - Имя функции:
// * Результат - Булево -
// * ТелоОтвета - Строка -
// * Ожидание - Булево -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураОтветHTTPЗапроса() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("Результат", Ложь);
	Структура.Вставить("ТелоОтвета", "");
	Структура.Вставить("Ожидание", Ложь);
	Структура.Вставить("ТекстОшибки", "");

	Возврат Структура;

КонецФункции

// Новая структура результат ввода счет Umcio.
// 
// Возвращаемое значение:
//  Структура - Новая структура результат ввода счет Umcio:
// * НомерСчета - Строка -
// * Сумма - Число -
Функция НоваяСтруктураРезультатВводаСчетUmcio() Экспорт
	
	Возврат Новый Структура("НомерСчета, Сумма", "", 0);
	
КонецФункции

// Новая структура результат регистрации чека в Umcio.
// 
// Возвращаемое значение:
//  Структура - Новая структура результат регистрации чека в Umcio:
// * Результат - Булево -
Функция НоваяСтруктураРезультатРегистрацииЧекаВUmcio() Экспорт
	
	Возврат Новый Структура("Результат", Ложь);
	
КонецФункции

// Новая структура товар чека Umico.
// 
// Возвращаемое значение:
//  Структура - Новая структура товар чека Umico:
// * item_number - Число -
// * product_id - Строка -
// * product_group_id - Строка -
// * quantity - Число -
// * price - Строка -
// * amount_before_promo - Строка -
// * amount_after_promo - Строка -
// * promo_discount_pct - Число -
// * desc_text - Строка -
Функция НоваяСтруктураТоварЧекаUmico() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("item_number", 0);
	Структура.Вставить("product_id", "");
	Структура.Вставить("product_group_id", "");
	Структура.Вставить("quantity", 0); 
	Структура.Вставить("price", ""); 
	Структура.Вставить("amount_before_promo", ""); 
	Структура.Вставить("amount_after_promo", ""); 
	Структура.Вставить("promo_discount_pct", 0); 
	Структура.Вставить("desc_text", "");
					
	Возврат Структура;
	
КонецФункции

// Новая структура товар чека возврата Umico.
// 
// Возвращаемое значение:
//  Структура - Новая структура товар чека возврата Umico:
// * item_number - Число -
// * product_id - Строка -
// * product_group_id - Строка -
// * quantity - Число -
// * order_item_number - Число -
// * refund_amount - Число -
// * desc_text - Строка -
Функция НоваяСтруктураТоварЧекаВозвратаUmico() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("item_number", 0);
	Структура.Вставить("product_id", "");
	Структура.Вставить("product_group_id", "");
	Структура.Вставить("quantity", 0); 
	Структура.Вставить("order_item_number", 0);
	Структура.Вставить("refund_amount", 0);
	Структура.Вставить("desc_text", "");
					
	Возврат Структура;
	
КонецФункции

#КонецОбласти

#КонецОбласти