// @strict-types

#Область СлужебныеПроцедурыИФункции

#Область ТипизирующиеФункции

// Новая структура JSONBalance.
// 
// Возвращаемое значение:
//  Структура - Новая структура JSONBalance:
// * available_points - Число -
Функция НоваяСтруктураJSONBalance() Экспорт
	
	Соответствие = Новый Структура;
	Соответствие.Вставить("available_points", 0);
	
	Возврат Соответствие;
	
КонецФункции

// Новая структура сведения о счете.
// 
// Возвращаемое значение:
//  Структура - Новая структура сведения о счете:
// * Результат - Булево -
// * Сумма - Число -
Функция НоваяСтруктураСведенияОСчете() Экспорт

	Возврат Новый Структура("Результат, Сумма", Ложь, 0);	

КонецФункции

#КонецОбласти

#КонецОбласти
