// @strict-types
#Область СлужебныеПроцедурыИФункции

#Область ТипизирующиеФункции

// Новая структура JSONBalance.
// 
// Возвращаемое значение:
//  Структура - Новая структура JSONBalance:
// * available_points - Число -
Функция НоваяСтруктураJSONBalance() Экспорт

	Соответствие = Новый Структура;
	Соответствие.Вставить("available_points", 0);

	Возврат Соответствие;

КонецФункции

// Новая структура сведения о счете.
// 
// Возвращаемое значение:
//  Структура - Новая структура сведения о счете:
// * Результат - Булево -
// * Сумма - Число -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураСведенияОСчете() Экспорт

	Возврат Новый Структура("Результат, Сумма, ТекстОшибки", Ложь, 0, "");

КонецФункции

// Новая структура ОтветHTTPЗапроса.
// 
// Возвращаемое значение:
//  Структура - Имя функции:
// * Результат - Булево -
// * ТелоОтвета - Строка -
// * Ожидание - Булево -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураОтветHTTPЗапроса() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("Результат", Ложь);
	Структура.Вставить("ТелоОтвета", "");
	Структура.Вставить("Ожидание", Ложь);
	Структура.Вставить("ТекстОшибки", "");

	Возврат Структура;

КонецФункции

// Новая структура результат ввода счет umcio.
// 
// Возвращаемое значение:
//  Структура - Новая структура результат ввода счет umcio:
// * НомерСчета - Строка -
// * Сумма - Число -
Функция НоваяСтруктураРезультатВводаСчетUmcio() Экспорт
	
	Возврат Новый Структура("НомерСчета, Сумма", "", 0);
	
КонецФункции

#КонецОбласти

#КонецОбласти