
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура UMC_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	UMC_ОбменСUmico.ПолучитьСтатусОбменаСUmico(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура UMC_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "UMC_ИзменениеСостоянияЧека" И Параметр = Объект.Ссылка Тогда
		UMC_ПолучитьСтатусОбменаСUmico();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура UMC_UMC_ОснованиеВозвратаUmicoПриИзмененииПосле(Элемент)
	
	UMC_ЗаполнитьРеквизитыUmico();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура UMC_ПолучитьСтатусОбменаСUmico()
	
	UMC_ОбменСUmicoВызовСервера.ПолучитьСтатусОбменаСUmico(ЭтотОбъект, Объект.Ссылка);	
	
КонецПроцедуры

&НаСервере
Процедура UMC_ЗаполнитьРеквизитыUmico()
	
	UMC_Значение = РеквизитФормыВЗначение("Объект");
	UMC_Значение.UMC_ЗаполнитьРеквизитыUmicoНаОсновании();
	ЗначениеВРеквизитФормы(UMC_Значение, "Объект");
	
КонецПроцедуры

#КонецОбласти