// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
Процедура UMC_ЗаполнитьРеквизитыUmicoНаОсновании() Экспорт
	
	UMC_РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(UMC_ОснованиеВозвратаUmico, "UMC_НомерКартыUmico");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, UMC_РеквизитыОснования);
	
КонецПроцедуры

#КонецОбласти	
	
#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура UMC_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		UMC_Основание = ДокументРеализации; // ДокументСсылка.РеализацияТоваровУслуг
		UMC_ОснованиеВозвратаUmico = UMC_Основание;
		
		UMC_ЗаполнитьРеквизитыUmicoНаОсновании();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
